
<!-- terraform-plan-dev -->
### 🌍 Terraform Plan – **DEV**

<details>
<summary>Click to expand</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.eks.aws_iam_role.node_role: Refreshing state... [id=dev-eks-node-role]
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=dev-eks-cluster-role]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-03941e8b2d25f3f29]
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-02e5e40119ff77865]
module.eks.aws_iam_role_policy_attachment.cluster_policy_attachment: Refreshing state... [id=dev-eks-cluster-role-20260315024213894800000001]
module.eks.aws_iam_role_policy_attachment.cni_policy: Refreshing state... [id=dev-eks-node-role-20260315024213929200000002]
module.eks.aws_iam_role_policy_attachment.ecr_policy: Refreshing state... [id=dev-eks-node-role-20260315024214025000000004]
module.eks.aws_iam_role_policy_attachment.worker_node_policy: Refreshing state... [id=dev-eks-node-role-20260315024213970800000003]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0ed3230ce3c9f338b]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-08d1a7f197809d3c9]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c2714b25b607fdd2]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e1270d209ec1793c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04117bbb5d82ac44e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03a90a5bde313b897]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-016182d3c57a8f471]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-01555449b895e4d17]
module.vpc.aws_nat_gateway.this: Refreshing state... [id=nat-03bff93448fbed3d8]
module.vpc.aws_route_table_association.public["2"]: Refreshing state... [id=rtbassoc-0acd29e151eeb9089]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-0fe9db76f6a82454e]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-0d3e441a1d1cb2a7b]
module.eks.aws_eks_cluster.this: Refreshing state... [id=Shared-cluster]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-037bb14dbc7767fc3]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-0f730af66fcc968aa]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-092883f9f24ac70d7]
module.vpc.aws_route_table_association.private["2"]: Refreshing state... [id=rtbassoc-0f25d456d39d8db71]
module.eks.data.tls_certificate.eks: Reading...
module.eks.aws_security_group_rule.alloow_private_endpoint_access[0]: Refreshing state... [id=sgrule-3699145044]
module.eks.aws_eks_node_group.this: Refreshing state... [id=Shared-cluster:dev-eks-node-group]
module.eks.data.tls_certificate.eks: Read complete after 0s [id=b1b539daa206035ae3c3e28288b0681fa1b462f3]
module.eks.aws_iam_openid_connect_provider.this: Refreshing state... [id=arn:aws:iam::358871393576:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/D0C5C94908C7A28AFF80A5D74294E608]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.addons.aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.12.4-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "Shared-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.addons.aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.34.1-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "Shared-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.addons.aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.20.3-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "Shared-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.vpc.aws_route_table.private will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-037bb14dbc7767fc3"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-03bff93448fbed3d8"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-03bff93448fbed3d8"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-private-rt"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + cluster_name       = "Shared-cluster"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
